particle-iot/device-os/hal/src/rtl872x/usart_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
#include "usart_hal.h"
#include "ringbuffer.h"
#include "pinmap_hal.h"
#include "gpio_hal.h"
#include <algorithm>
#include <memory>
#include "hal_irq_flag.h"
#include "delay_hal.h"
#include "interrupts_hal.h"
#include "usart_hal_private.h"
#include "timer_hal.h"
#include "service_debug.h"
#include "atomic_section.h"
#include "flash_common.h"

#ifdef __cplusplus
extern "C" {
#endif
#include "rtl8721d.h"
#ifdef __cplusplus
}
#endif

namespace {

constexpr uint32_t BIT_CFGX_LO_FIFO_EMPTY = (1 << 9);
constexpr uint32_t BIT_CFGX_LO_CH_SUSP = (1 << 8);

void dcacheInvalidateAligned(uintptr_t ptr, size_t size) {
    uintptr_t alignedPtr = ptr & ~(portBYTE_ALIGNMENT_MASK);
    uintptr_t end = ptr + size;
    size_t alignedSize = CEIL_DIV(end - alignedPtr, portBYTE_ALIGNMENT) * portBYTE_ALIGNMENT;
    DCache_Invalidate(alignedPtr, alignedSize);
}

// Do not initiate DMA RX transfers is acquirable space is below this threshold
// This is the same as on Gen 3 to bring similar behavior
constexpr size_t RX_THRESHOLD = 4;

} // anonymous


class Usart {
public:
    struct Config {
        unsigned int baudRate;
        unsigned int config;
    };

    class AtomicBlock {
    public:
        AtomicBlock(Usart* instance)
                : uart_(instance) {
            enabled_ = NVIC_GetEnableIRQ(uart_->uartTable_[uart_->index_].IrqNum);
            NVIC_DisableIRQ(uart_->uartTable_[uart_->index_].IrqNum);
        }
        ~AtomicBlock() {
            if (enabled_) {
                NVIC_EnableIRQ(uart_->uartTable_[uart_->index_].IrqNum);
            }
        }
    private:
        Usart* uart_;
        bool enabled_;
    };

    class RxLock {
    public:
        RxLock(Usart* instance)
                : uart_(instance),
                  locked_(0) {
            uart_->rxLock(true);
            locked_++;
        }
        ~RxLock() {
            locked_--;
            if (locked_ == 0) {
                uart_->rxLock(false);
            }
        }
    private:
        Usart* uart_;
        uint32_t locked_;
    };

    class TxLock {
    public:
        TxLock(Usart* instance)
                : uart_(instance),
                  locked_(0) {
            uart_->txLock(true);
            locked_++;
        }
        ~TxLock() {
            locked_--;
            if (locked_ == 0) {
                uart_->txLock(false);
            }
        }
    private:
        Usart* uart_;
        uint32_t locked_;
    };

    bool isEnabled() const {
        return state_ == HAL_USART_STATE_ENABLED;
    }

    bool isConfigured() const {
        return configured_;
    }

    int getFeatures(uint32_t* features) {
        *features = 0;
        *features |= (SERIAL_7E1 | SERIAL_7E2 | SERIAL_7O1 | SERIAL_7O2
                     |SERIAL_8N1 | SERIAL_8E1 | SERIAL_8N2 | SERIAL_8E2 | SERIAL_8O1 | SERIAL_8O2);
        if (index_ != 2) {
            *features |= SERIAL_FLOW_CONTROL_RTS_CTS;
        }
        return SYSTEM_ERROR_NONE;
    }

    int init(const hal_usart_buffer_config_t& conf) {
        if (isEnabled()) {
            flush();
            CHECK(end());
        }
        if (isConfigured()) {
            CHECK(deInit());
        }
        CHECK_TRUE(conf.rx_buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(conf.rx_buffer_size, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(conf.tx_buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(conf.tx_buffer_size, SYSTEM_ERROR_INVALID_ARGUMENT);
        // Caching routines require 32-byte aligned buffers
        // Normally heap allocations (and normally buffers come out of heap)
        // should be aligned to portBYTE_ALIGNMENT (which is defined to 32 on RTL872x port)
        // Adjust here if required
        void* rxBuf = conf.rx_buffer;
        size_t rxBufSize = conf.rx_buffer_size;
        void* txBuf = conf.tx_buffer;
        size_t txBufSize = conf.tx_buffer_size;
        if (((uintptr_t)rxBuf & portBYTE_ALIGNMENT_MASK) != 0) {
            if (conf.rx_buffer_size < portBYTE_ALIGNMENT) {
                return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            rxBuf = std::align(portBYTE_ALIGNMENT, conf.rx_buffer_size - portBYTE_ALIGNMENT, rxBuf, rxBufSize);
            rxBufSize = (rxBufSize / portBYTE_ALIGNMENT) * portBYTE_ALIGNMENT;
        }
        if (((uintptr_t)txBuf & portBYTE_ALIGNMENT_MASK) != 0) {
            if (conf.tx_buffer_size < portBYTE_ALIGNMENT) {
                return SYSTEM_ERROR_NOT_ENOUGH_DATA;
            }
            txBuf = std::align(portBYTE_ALIGNMENT, conf.tx_buffer_size - portBYTE_ALIGNMENT, txBuf, txBufSize);
            txBufSize = (txBufSize / portBYTE_ALIGNMENT) * portBYTE_ALIGNMENT;
        }
        CHECK_TRUE(rxBuf, SYSTEM_ERROR_NOT_ENOUGH_DATA);
        CHECK_TRUE(rxBufSize >= portBYTE_ALIGNMENT, SYSTEM_ERROR_NOT_ENOUGH_DATA);
        CHECK_TRUE(txBuf, SYSTEM_ERROR_NOT_ENOUGH_DATA);
        CHECK_TRUE(txBufSize >= portBYTE_ALIGNMENT, SYSTEM_ERROR_NOT_ENOUGH_DATA);
        rxBuffer_.init((uint8_t*)rxBuf, rxBufSize);
        txBuffer_.init((uint8_t*)txBuf, txBufSize);
        DCache_CleanInvalidate((uintptr_t)rxBuf, rxBufSize);
        DCache_CleanInvalidate((uintptr_t)txBuf, txBufSize);
        configured_ = true;
        return SYSTEM_ERROR_NONE;
    }

    int deInit() {
        configured_ = false;
        return SYSTEM_ERROR_NONE;
    }

