particle-iot/device-os/hal/src/rtl872x/usart_hal.cpp
    static uint32_t uartTxRxIntHandler(void* data) {
        auto uart = (Usart*)data;
        auto uartInstance = uart->uartTable_[uart->index_].UARTx;
        volatile uint8_t regIir = UART_IntStatus(uartInstance);
        if ((regIir & RUART_IIR_INT_PEND) != 0) {
            // No pending IRQ
            return 0;
        }
        BaseType_t yield = pdFALSE;
        bool eventGenerated = false;
        uint8_t intId = (regIir & RUART_IIR_INT_ID) >> 1;
        switch (intId) {
            case RUART_LP_RX_MONITOR_DONE: {
                UART_RxMonitorSatusGet(uartInstance);
                break;
            }
            case RUART_MODEM_STATUS: {
                UART_ModemStatusGet(uartInstance);
                break;
            }
            case RUART_TX_FIFO_EMPTY: {
                if (uart->useInterrupt()) {
                    if (uart->transmitting_) {
                        uart->curTxCount_ = 0;
                        uart->transmitting_ = false;
                        uart->startTransmission();
                    }
                    if (!uart->transmitting_) {
                        uart->uartIntConfig(uartInstance, RUART_IER_ETBEI, DISABLE);
                    }
                } else {
                    uart->uartIntConfig(uartInstance, RUART_IER_ETBEI, DISABLE);
                    UART_TXDMACmd(uartInstance, ENABLE);
                    if (!uart->transmitting_) {
                        uart->busy_ = false; // All bytes sent if no new DMA transfers are in progress
                    }
                }
                if (xEventGroupSetBitsFromISR(uart->evGroup_, HAL_USART_PVT_EVENT_WRITABLE, &yield) != pdFAIL) {
                    eventGenerated = true;
                }
                break;
            }
            case RUART_RECEIVE_LINE_STATUS:
                UART_LineStatusGet(uartInstance);
                /* fallthrough */
            case RUART_RECEIVER_DATA_AVAILABLE:
            case RUART_TIME_OUT_INDICATION: {
                uart->uartIntConfig(uartInstance, (RUART_IER_ERBI | RUART_IER_ELSI | RUART_IER_ETOI), DISABLE);
                if (uart->receiving_) {
                    if (uart->useInterrupt()) {
                        uart->receiving_ = false;
                        const bool rtsFlow = (uart->config_.config & SERIAL_FLOW_CONTROL_RTS) != 0;
                        if (uart->rxBuffer_.space() > 0 || !rtsFlow) {
                            uint8_t temp[MAX_UART_FIFO_SIZE];
                            uint32_t inFifo = UART_ReceiveDataTO(uartInstance, temp, MAX_UART_FIFO_SIZE, 1);
                            const ssize_t canWrite = uart->rxBuffer_.space();
                            if (canWrite > 0) {
                                uart->rxBuffer_.put(temp, std::min((uint32_t)canWrite, inFifo));
                            }
                            uart->startReceiver();
                        }
                    } else {
                        UART_RXDMACmd(uartInstance, ENABLE);
                    }
                    if (xEventGroupSetBitsFromISR(uart->evGroup_, HAL_USART_PVT_EVENT_READABLE, &yield) != pdFAIL) {
                        eventGenerated = true;
                    }
                }
                break;
            }
            default: break;
        }
        if (eventGenerated) {
            portYIELD_FROM_ISR(yield);
        }
        return 0;
    }

private:
    Usart(uint8_t index, hal_pin_t txPin, hal_pin_t rxPin, hal_pin_t ctsPin, hal_pin_t rtsPin)
            : txPin_(txPin),
              rxPin_(rxPin),
              ctsPin_(ctsPin),
              rtsPin_(rtsPin),
              txDmaInitStruct_{},
              rxDmaInitStruct_{},
              config_(),
              curTxCount_(0),
              state_(HAL_USART_STATE_DISABLED),
              transmitting_(false),
              busy_(false),
              receiving_(false),
              configured_(false),
              index_(index),
              evGroup_(nullptr) {
        evGroup_ = xEventGroupCreate();
        SPARK_ASSERT(evGroup_);
        // LOG UART is enabled on boot
        if (index_ == 2) {
            state_ = HAL_USART_STATE_ENABLED;
        }
    }
    ~Usart() = default;

    int disable(bool end = true) {
        CHECK_TRUE(isEnabled(), SYSTEM_ERROR_INVALID_STATE);

        auto uartInstance = uartTable_[index_].UARTx;
        if (!useInterrupt()) {
            deinitDmaChannels();
        } else {
            InterruptDis(uartTable_[index_].IrqNum);
            InterruptUnRegister(uartTable_[index_].IrqNum);
        }
        // In case events group is involved when using DMA mode.
        uartIntConfig(uartInstance, RUART_IER_ETBEI, DISABLE);
        uartIntConfig(uartInstance, (RUART_IER_ERBI | RUART_IER_ELSI | RUART_IER_ETOI), DISABLE);
        UART_ClearTxFifo(uartInstance);
        UART_ClearRxFifo(uartInstance);
        UART_DeInit(uartInstance);
        if (uartInstance == UART0_DEV) {
            RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, DISABLE);
        }
        // Do not change the pull ability to not mess up the peer device.
        Pinmux_Config(hal_pin_to_rtl_pin(txPin_), PINMUX_FUNCTION_GPIO);
        Pinmux_Config(hal_pin_to_rtl_pin(rxPin_), PINMUX_FUNCTION_GPIO);
        if (ctsPin_ != PIN_INVALID && (config_.config & SERIAL_FLOW_CONTROL_CTS)) {
            Pinmux_Config(hal_pin_to_rtl_pin(ctsPin_), PINMUX_FUNCTION_GPIO);
        }
        if (rtsPin_ != PIN_INVALID && (config_.config & SERIAL_FLOW_CONTROL_RTS)) {
            Pinmux_Config(hal_pin_to_rtl_pin(rtsPin_), PINMUX_FUNCTION_GPIO);
        }

        // Configuring the input pins' mode to PIN_MODE_NONE will disconnect input buffer to enable power savings
        // Configuring the output pins' mode to INPUT_PULLUP to not polluting the state on other side.
        hal_gpio_mode(txPin_, end ? PIN_MODE_NONE : INPUT_PULLUP);
        hal_gpio_mode(rxPin_, PIN_MODE_NONE);
        if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
            hal_gpio_mode(rtsPin_, end ? PIN_MODE_NONE : INPUT_PULLUP);
        }
        if (config_.config & SERIAL_FLOW_CONTROL_CTS) {
            hal_gpio_mode(ctsPin_, PIN_MODE_NONE);
        }
        if (end) {
            hal_pin_set_function(txPin_, PF_NONE);
            hal_pin_set_function(rxPin_, PF_NONE);
            if (config_.config & SERIAL_FLOW_CONTROL_RTS) {
                hal_pin_set_function(rtsPin_, PF_NONE);
            }
            if (config_.config & SERIAL_FLOW_CONTROL_CTS) {
                hal_pin_set_function(ctsPin_, PF_NONE);
            }
        }

        return SYSTEM_ERROR_NONE;
    }

    bool useInterrupt() {
        auto instance = uartTable_[index_].UARTx;
        if (instance == UART2_DEV || instance == UART3_DEV) {
            return true;
        }
        return false;
    }


    bool validateConfig(unsigned int config) {
        CHECK_TRUE((config & SERIAL_DATA_BITS) == SERIAL_DATA_BITS_7 ||
                   (config & SERIAL_DATA_BITS) == SERIAL_DATA_BITS_8, false);
        CHECK_TRUE((config & SERIAL_STOP_BITS) == SERIAL_STOP_BITS_1 ||
                   (config & SERIAL_STOP_BITS) == SERIAL_STOP_BITS_2, false);
        CHECK_TRUE((config & SERIAL_PARITY) == SERIAL_PARITY_NO ||
                   (config & SERIAL_PARITY) == SERIAL_PARITY_EVEN ||
                   (config & SERIAL_PARITY) == SERIAL_PARITY_ODD, false);
        CHECK_TRUE((config & SERIAL_HALF_DUPLEX) == 0, false);
        CHECK_TRUE((config & LIN_MODE) == 0, false);
        return true;
    }

    bool initDmaChannels() {
        auto uartInstance = uartTable_[index_].UARTx;
        UART_TXDMAConfig(uartInstance, 8);
        UART_TXDMACmd(uartInstance, ENABLE);

